In [1]:
import pandas as pd

In [2]:
x = pd.DataFrame({ 'RollNo':[101,102,103,104,105],'Names':['Jyey','Gourav','Akkii','Amit','JAck']})

In [3]:
x

   RollNo   Names
0     101    Jyey
1     102  Gourav
2     103   Akkii
3     104    Amit
4     105    JAck

In [4]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  5 non-null      int64
 1   Names   5 non-null      object
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [5]:
x.describe()

           RollNo
count    5.000000
mean   103.000000
std      1.581139
min    101.000000
25%    102.000000
50%    103.000000
75%    104.000000
max    105.000000

In [6]:
x

   RollNo   Names
0     101    Jyey
1     102  Gourav
2     103   Akkii
3     104    Amit
4     105    JAck

In [7]:
x describe()

SyntaxError: invalid syntax (528710882.py, line 1)

In [8]:
x.describe()

           RollNo
count    5.000000
mean   103.000000
std      1.581139
min    101.000000
25%    102.000000
50%    103.000000
75%    104.000000
max    105.000000

In [9]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  5 non-null      int64
 1   Names   5 non-null      object
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [10]:
x.isnull()

   RollNo  Names
0   False  False
1   False  False
2   False  False
3   False  False
4   False  False

In [11]:
x.head()

   RollNo   Names
0     101    Jyey
1     102  Gourav
2     103   Akkii
3     104    Amit
4     105    JAck

In [12]:
x = pd.DataFrame(
    [[1, 2, 3, 4, 5],
     [6, 7, 8, 9, 10]],
    index=[1, 2],
    columns=['a', 'b', 'c', 'd', 'e']
)

In [13]:
x

   a  b  c  d   e
1  1  2  3  4   5
2  6  7  8  9  10

In [14]:
x.dropna()

   a  b  c  d   e
1  1  2  3  4   5
2  6  7  8  9  10

In [15]:
x.tail()

   a  b  c  d   e
1  1  2  3  4   5
2  6  7  8  9  10